{
  "total_topics": 3,
  "total_documents": 4198,
  "outliers_count": 1754,
  "topics": {
    "0": {
      "topic_id": 0,
      "count": 2365,
      "top_words": [
        "just",
        "like",
        "thoughts",
        "time",
        "feel",
        "mind",
        "don",
        "life",
        "think",
        "things"
      ],
      "representative_docs": [
        "How to deal with morning stress. I am currently unemployed after a PhD and get major guilt and FOMO about not utilising my day, any thoughts? Hi all. So most mornings I wake up earlier than I would like and immediatley start thinking about what I would like to do today. I then think about the backlog of chores, job hunting etc and start to stress that my generally terrible prioritisation skills (I have ADHD) will end with me not optimising my day. I try to tell myself to trust myself and that my day doesn't need to be optimal and try to start my day calmly with a bit of TV and breakfast. I normally then look at my planner and get anxious again. I then just start doing any high priority task but I find that I cannot concentrate on it and am just constantly stressing about whether or not it's the right thing to be doing right now and if I'm doing it too slowly so that I'm clogging up other tasks. Again I try to be mindful and calm myself and just settle into the task, but these thoughts are so persistent. The worst thing is that most of these tasks are very low stakes hobby tasks. I'm currently unemployed after finishing my PhD and I think partly there is a residual mind pattern from my PhD where I genuinely did have to stress about what I did and as its all self-disciplined I would always feel guilty for taking any time off. I also think it's partly FOMO as I'm aware that this time I have between jobs is a rare opportunity to do extra things I've always wanted to do. And throughout my PhD I always said \"when you're done\" to any desire I had. So now I want to do all sorts of things, painting, Woodwork, Spanish, coding, new games and more and I just get very overwhelmed. I've tried learning about non-striving and mindfulness but I struggle to link it with my day as I often find myself just lying in bed when I allow myself to not strive. Any thoughts would be much appreciated, thanks!",
        "Recognize that (and I think you do) in the situation you described, nothing apart from you is making you suffer. You are using your own thoughts to hurt yourself, and it seems here you have recognized that the thoughts aren’t even rational to begin with. When I get into a funk like this, I will treat my thoughts the same way I treat Alexa™️ when she is stuck on a bad playlist. “Alexa, next. Alexa, next.” Except for now it’s “Mind, next. Mind, next.” It’s important to shake those thoughts out most of the time. Just get them out of there ya know? The more you let these thoughts dwell, the more your brain will build and reinforce a neuronal superhighway that takes you straight into depression town. It simply responds to demand. If, based on your thoughts, it seems you want an easy-access way to put yourself down, the brain will give you that. Instead we can try forcing better thoughts, as fake as they may be. The brain doesn’t care, it will start building that neural pathway anyway. Eventually these better thoughts start to ring true, while the old “depression highway” in your head starts to decay from abandonment. Soon there’s only one neuronal path left: the one of good thoughts you’ve worked hard to build. Whatever thoughts you want to have more of, start out by thinking em by force if you have to. Meditate on the goodness you see in yourself — just hold the thought that you are good, etc. in your otherwise-quiet mind. Be so, so nice to yourself. Choose yourself first, be your own best friend, pump yourself up…. Fake it til your brain makes it. And by the way, it is a good thing that you are able to recognize that one of your thoughts isn’t being fair to you, or anyone else for that matter. That means they don’t resonate with you, you don’t believe them, and you want ‘em gone anyway. That makes the whole thing a lot easier.",
        "Help me stay strong in the midst of my father’s drug addiction. I’ve felt uneasy all week, anxious, because my father has revealed himself to be a cocaine addict. And I’m fearful of where it’s going to lead to. I’m 27, he’s 58. Also got my mom and sister. Early this year, after my parents fought, my dad was acting weird. Laying in bed all day, strange behavior, looked like shit. I live alone, rest of my family lives together. But I do work for the family business. We all do. So in that sense I’ve never been independent. Still rely on my parent’s income. I mean sure I get paid salary and such and use that to pay my rent and bills, my own stuff. But still, in a way I’m relying on their income. Work 9-5 of course. After several nights of this my sister and mom find lines of cocaine in his room. They confront him about and begin a screaming match. He talked to me about it, said he felt bad. Crying. That he uses this as an escape due to his depression. In his defense, he childhood was not an easy one. Had to take care of a schizophrenic mother since he was little. Practically alone. And this led him with depressive episode in his life. I wasn’t aware he was doing coke however, it shocked me, until it began to explain some strange behaviors of his I observed throughout my life. Made sense. Told me he left the cocaine out on purpose cause he just wanted to episode over with. The way I see it he does this for some kind of attention, or some needed pity I don’t know My mom forgave him, my sister didn’t. And all was well these past few months. Last week though he seems to have fallen in the habit again. This time for no reason. Or at least not a reason I know. My family is telling me he doesn’t come home at nights. I know he goes to the family business and seems to do shit there. On Monday I found some opened beers just there. And even weird on Friday… a fucking sex toy. A dildo from the local sex shop. Not the toy itself but the shop bag and the product’s box. I’m to scared to find out whether he’s with another woman or he’s on his own but whatever it is, he’s into some weird sexual shit. He made me make a check for him so he can cash some money (made me lie to my mom about some fake transaction to excuse this money). My mom controls the finances, my dad is one of those guys that needs to asks for permission to buy something for himself or get some cash. I’ve always had to do stuff like that for him in the past. He hides money for that reason. Of course I confessed to my mom this time because I know he’s using it for drug money. When I went into his room, shit looked like generally a crack den or something. Odd smell, bed with no blankets, thrown all over the floor, napkins all over the floor, just a shit hole. He’s also paranoid as fuck. He accused my sister of hiring 5 dudes to follow him last weekend and always seems on edge. I always told my parents to leave me alone when it comes to their marital problems, that I don’t care. I’ve always hated their marriage, they’re bad for each other. My mother’s a narcissistic woman who has yelled to me on the daily. Sure she shown her affection and love, but I was never close to her because it can talk to her without her criticizing me in some way and beginning to shout. Father is a ticking time bomb. I could never stand up to him. Always began to yell very loud and intimidate me. Grew up fearful around him. Used the belt and smacked me around some times. So as a result I’ve never been close to my family. Which why I moved out. Sure I love them, and talk to them occasionally and go to the family dinners here and there but the truth is I don’t respect them as people. I also have general anxiety and ADHD, I mention this because I also think it played a role in me deciding to stay safe and stay in the family business and do my own thing. Right now here are my fears. 1. That my dad is going to get more intense and start coming up with dangerous ways to get his drugs. I’m scared things will get physical and it’ll be up to me to fight him and I’m not sure I’ll be able to defend myself. That he will damage me. I don’t know like I have this fear of physical danger. I have no idea what lengths he’ll go through. 2. My job and my rented house. Both dependent on my parents. I rented an apartment on my own a while, should’ve stayed. Parents offered me a house so long as I pay the same rent I was paying for the apt, take care of the bills, and maintenance. Took the the deal because it was a nice house and I was able to afford the rent, if just barley. Now, stupid idea in hindsight. Another bit of power I gave them over me. Same for the job. My mom already threatened divorce. I have no idea what will happen to the houses my parents own, to the business and all that. Dad said he’s likely going to sell the business, and he’s going to fight to get as much as he can and not care whether me and my sister get anything. Which whatever I guess it’s fair it’s his business he started it. Point is, I’m scare for my financial safety as well. Gonna have to look for a job maybe and I fucked up staying in the family business cause I don’t think anybody will take that seriously. Not to mention I likely won’t find a job that pays me enough to continue renting… anything. Gonna start anew, and where will I be. Where will I move to. I do have an accounting bachelors… which I never used. 3. My mental health. Already bad enough as it is with ADHD and anxiety. This shit was been a weight in my body all week. I’m on edge. Haven’t gone to the gym and slept like shit. I do practice mindfulness and meditation. Have so for a good while and it helps. Sometimes returning the present helps. But again, that weight of my fearful thoughts are there. I know I sound selfish here… thinking only of myself. But it’s helped me cope, being selfish, when it came to these situation. Used to be fearful of my parents separating, when they’d fight and yell at each other. It was scary to see. But growing older has made me start giving less fucks. And I don’t see why I should allow their flaws and emotional/mental states bring me down as well. In a perfect world, I should’ve gotten my job, and my own house (or at least, stayed in my apartment). Leave all this behind and let them deal with each other… but I was scared then. I let my ADHD control me and didn’t want to leave my comfort zone. I was fearful of my father who pressured me to stay in the family business. I let the thought of having a big house to myself lure me into giving my parents more power over me. I knew it was a bad idea at the time. Now I will likely pay the price. But now that I’m here, there’s not point in living in a what if scenario. I’m here now, having to deal with this. And I don’t know why to do. I don’t know what to feel. What the right thing to do is. I’m lost. I’m fearful of my safety. Scared what my dad can possibly due to my mom and sister. (My mom is a traditional old woman, she has stuck with my dad through his bullshit, even physical abuse, and she’s very indecisive in general, she will not do what she needs to do until it’s too late). I’m scared of my financial situation. I have no power. I also feel morally bankrupt for not really caring about my dad and his addiction. I’m just looking out for me at this point. My biggest concern is me. And I feel selfish. All I can do is accept the situation, and hope the worst doesn’t come. Sorry the long lost, don’t really have anybody to talk to. Therapy is expansive, and insurance doesn’t cover it. Needed to vent. Again I feel lost. Unsure of what to do. It’s going to likely crumble down and I don’t know if I’m ready. The shitty thing about being raised under a wealthy family is… you’re not prepared for the worst. Ive been so comfortable in life, and it seems like that’s not going to happen anymore. And I’m scared."
      ],
      "topic_label": "Topic 0: just, like, thoughts"
    },
    "1": {
      "topic_id": 1,
      "count": 68,
      "top_words": [
        "subreddit",
        "account",
        "message",
        "comment",
        "performed automatically",
        "standing check",
        "action performed",
        "automatically contact",
        "active good",
        "bot action"
      ],
      "representative_docs": [
        "Your comment has been removed because of this subreddit’s account requirements. You have not broken any rules, and your account is still active and in good standing. Please check your notifications for more information! I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=) if you have any questions or concerns.",
        "Your comment has been removed because of this subreddit’s account requirements. You have not broken any rules, and your account is still active and in good standing. Please check your notifications for more information! I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=) if you have any questions or concerns.",
        "Your comment has been removed because of this subreddit’s account requirements. You have not broken any rules, and your account is still active and in good standing. Please check your notifications for more information! I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=) if you have any questions or concerns."
      ],
      "topic_label": "Topic 1: subreddit, account, message"
    },
    "2": {
      "topic_id": 2,
      "count": 11,
      "top_words": [
        "sleep",
        "health",
        "food",
        "people",
        "lot",
        "weight",
        "want",
        "eat",
        "doesn",
        "states"
      ],
      "representative_docs": [
        "I follow [Dr Davis’ recipe]( exactly. I’ve had no issues culturing it. The starter culture is a bit expensive, though, like 40 dollars. I could mail you a couple capsules to get you started if you’re interested, assuming you’re in the U.S. There are other cultures that could be beneficial, such as L. gasseri and B. Subtilis. Kombucha contains some beneficial strains as well. But all in all the L. Reuteri is by far the most impactful. The most common effect people report when taking it is that their sleep improves, maybe if you got a deeper sleep you wouldn’t be tempted to oversleep. My wife has schizophrenia and it affects her sleep a lot, she can’t sleep very deep and so she has to compensate by sleeping basically all day. She gets headaches a lot too. I’m hoping this yogurt will help her, but she doesn’t even like yogurt, so now I gotta make her a milkshake or something, lol",
        "It's been suggested to make yogurt out of it as a way to produce more of the culture as it's expensive to take in the quantities Dr Davis thinks you need to see benefits. However, recently there's been a lot of talk about tests proving that the yogurt (milk based) not only doesn't have the amount claimed, but often has no L reuteri at all, and is cultured with many other bacteria types. How that happens I don't know, but that's what they found, supposedly. But according to the same people it does work pretty well with coconut milk. No idea if that's the canned stuff or the kind you pour on cereal, but they seem to want a high fat medium. If you want to try making it, I recommend you look into it more first and figure out if you have what you need, or if it's worth investing in stuff. It's a whole ordeal. Lots of failed attempts for most people, and you never really know what you've cultured in the end, or whether it's good or bad for you. Might want to just stick with taking the pills as is, instead of doing all that. Either way make sure you get a strain that's been well researched.",
        "Yeah, that sounds familiar. I think education around carbs and sugars can be quite confusing... and the community of people who talk about \"cutting all sugars out to lose weight\" often miss the larger picture of health, and only know it as a hack to not be hungry. Fruit sugars (when in fruit form) are much different from glucose and fructose, nothing inherently bad about them. And carbs are an important part of the diet. (Sorry keto community) Many people eat carbs freely for the heavy, satisfying feeling the provide. She may be missing this feeling too, which makes new coping behaviors arise as well Yes carbs will rise blood glucose and can cause weight gain, but, when eaten intentionally, after a lot of vegetables and leafy greens, this aspect can be avoided. The fibers from the leafy greens will coat the digestive tract and slow glucose uptake changing the insulin response. It's quite neat. Chinese medicine calls carbs like rice and bread \"main food\". Never eat main food without vegetables is the mantra. Perhaps this specific education could help her sense of guilt around carbs Going back to your stepdaughter, cutting out carbs out can really change energy levels. She may find herself in more and more ketogenic states, which many people strive for during weight loss, but there's a lot of education that should go along with it. One strange thing about ketogenic states is that once your body adjusts, you don't get the same highs and lows before from eating like you would with carbs and sugars from the insulin waves. I suspect this \"flatlining\" of emotion can also trigger behaviors to \"feel good\", since food is no longer playing that role, and there's a guilt associated with it. And at the same time the gut bacteria that liked sugar also get upset and cause depressive states because they're no longer being satisfied. Education around how gut health completely changes emotion and day to day feeling of well being could also be helpful."
      ],
      "topic_label": "Topic 2: sleep, health, food"
    }
  }
}